<div class="row text-white where-block bg-secondary-fitten">
    <h1 class="text-center mt-4 mb-4">Организационные вопросы.</h1>
    <div>
        <p>Мероприятие пройдёт: 2 сентября в 14:00</p>
        <p>Место: Ресторан «Времена года» в Центральном Парке Культуры и Отдыха им. Горького. Главный вход в ресторан на первом этаже.</p>
        <p>Адрес: ул. Крымский Вал, 9, стр.20, Москва</p>
        <p>Дресс код:</p>
        <ul>
            <li>На торжество: каблуки и платье у девушек, элегантный вид мужчин, дети - в чистом. </li>
            <li>На танцы и прогулки по парку ночью – удобную обувь и комфортную одежду.</li>
        </ul>
        <p>В программе предусмотрены:</p>
        <ul>
            <li>Фуршет с 14:00 до 15:30.</li>
            <li>Будет фотозона с камином и отличный фотограф.  Задачка у фотографа сложная – сделать КАЖДОЙ паре и семье фото с праздника на память. Желательно, фото сделать во время приветственного фуршета, пока все свежие и культурные. Прошу всех приходить с 14:00.</li>
            <li>В 15:30 ОБЩАЯ ФОТО на память!</li>
            <li>В 16:00 час тостов и поздравлений мне</li>
            <li>Для детей с 17:00 до 19:00 будут приглашены аниматоры и для них забронирован соседний зал в шаговой доступности и без доступа посторонних людей</li>
            <li>Для взрослых с 17:00 до 19:00 будет концерт полюбившейся с прошлого года группы «LimeNoir». Правда без саксофона, но ребята обещают «огонь». Плей-лист согласован/</li>
            <li>В перерывах концерта тосты моей второй и первостепенной половине – Сергею</li>
            <li>В 20:00 торт</li>
            <li>С 21:00 дискотека с диджеем «для стойких» </li>
            <li>В 23:59 2 сентября «я календарь переверну!»</li>
            <li></li>
        </ul>
        <div>
            <script type="text/javascript" charset="utf-8" async src="https://api-maps.yandex.ru/services/constructor/1.0/js/?um=constructor%3A977ad6799fb325929a0137e4a44c5ed6f4ee48900b164e1b1a1d3a18aec05a41&amp;width=100%25&amp;height=240&amp;lang=ru_RU&amp;scroll=true"></script>        </div>
        <div class="row text-white pb-5 timer-block">
            <hr class="style-volna2">
            <script src="/js/timer2.js"></script>
        </div>
    </div>
</div>
